//位运算的学习


public class BitOperator {
	public static void main(String[] args) {
	    //要2的补码，就要2的原码
	    //2的补码00000000 00000000 00000000 00000010
	    //3的补码就是00000000 00000000 00000000 00000011
	    //按位与是&
	    //故得2&3=2
		System.out.println(2&3);//为2
		//推导
		//1.-2的原码10000000 00000000 00000000 00000010
		//-2的反码11111111 11111111 11111111 11111101
		//3.-2的补码 = 反码 + 1 /11111111 11111111 11111111 11111110
		//4.~-2的操作 00000000 00000000 00000000 00000001
		System.out.println(~-2);//为1
		//~2操作后为补码，需先变为反码再转为原码
		System.out.println(~2);//为-3
		System.out.println(2|3);//为3
		System.out.println(2^3);//1

		int a = 1>>2;
		System.out.println(3 >>> 1);
	}
}